#include <iostream>
#include <windows.h>
#define MODE 1

int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	#ifndef MODE
	std::cout << "Определите значение MODE" << std::endl;
	return 1;
#endif

	std::cout << "MODE = " << MODE << std::endl;


#if MODE == 0
	std::cout << "Работаю в режиме тренировки" << std::endl;
#elif MODE == 1
	std::cout << "Работаю в боевом режиме" << std::endl;
#define ADD(a, b) std::cout << (a + b)
	int a{ 0 }, b{ 0 };
	std::cout << "Введите два числа:\nПервое число: ";
	std::cin >> a;
	std::cout << "Второе число: ";
	std::cin >> b;
	std::cout << "Результат сложения: ";
	ADD(a, b);
#else
	std::cout << "Неизвестный режим. Завершение работы" << std::endl;
#endif
	return 0;
}